Merge pull request #52 from harmoniqs/feature/simple-traj-caching
Add transparent trajectory caching for docs builds
